---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyDistance
source: html/89defa0e-cfb9-b97b-9f6b-982b860f8a61.htm
---
# AssetPropertyDistance Members

Adds a new connected asset attached to this asset property, if it allows it.